from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template(
    "أنت مساعد لتوليد رد للمستخدم.\nستحصل على مجموعة من المستندات المرتبطة باستفسار المستخدم.\nعليك توليد رد بناءً على المستندات المقدمة.\nتجاهل المستندات التي لا تتعلق باستفسار المستخدم.\nيمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.\nعليك توليد الرد بنفس لغة استفسار المستخدم.\nكن مؤدباً ومحترماً في التعامل مع المستخدم.\nكن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية."
)

#### Document ####
document_prompt = Template("## المستند رقم: $doc_num\n### المحتوى: $chunk_text")

#### Footer ####
footer_prompt = Template(
    "بناءً فقط على المستندات المذكورة أعلاه، يرجى توليد إجابة للمستخدم.\n## السؤال:\n$query\n\n## الإجابة:"
)
